# Diandra O'Connor Module 5 Project 2/6/23

## Task 4 - SQL (from 17.2)

### SQL_exercise

## Section 17.2.1 A books Database

### Import modules, connect to the database, create a table using books.sql script from author files

In [8]:
import sqlite3

connection = sqlite3.connect('books.db')

### Display DataFrame of authors table

In [10]:
import pandas as pd

pd.options.display.max_columns = 10  # set max columns to display as 10

pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])  # set DataFrame row index as 'id'

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

### Display DataFrame of titles table

In [11]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

### Display DataFrame of author_ISBN table

In [12]:
pd.read_sql('SELECT * FROM author_ISBN', connection)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302

## Section 17.2.2 SELECT

### Display DataFrame with only authors first and last columns from the authors table

In [13]:
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

## Section 17.2.3 WHERE

### Display DataFrame with columns of title, edition and copyright for books with copyright greater than 2016 from titles table

In [14]:
pd.read_sql("""SELECT title, edition, copyright FROM titles WHERE copyright > '2016'""", connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

### Display DataFrame with columns id, last and first that contains all authors whose last name starts with D from the authors table

In [15]:
pd.read_sql("""SELECT id, first, last FROM authors WHERE last LIKE 'D%'""", connection, index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

### Display DataFrame with columns id, first and last that contains all authors whose last name starts with any character, followed by the letter b, followed by any number of additional characters

In [16]:
pd.read_sql("""SELECT id, first, last
            FROM authors  
            WHERE first LIKE '_b%'""", connection, index_col=['id'])

    first    last
id
3   Abbey  Deitel

## Section 17.2.4 ORDER BY

### Ascending order
#### Display DataFrame with title column, sorted in ascending order, from titles table

In [17]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection) # ASC optional since ascending is default

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [18]:
pd.read_sql('SELECT title FROM titles ORDER BY title', connection) # note same result without using ASC

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

### Sort by multiple columns

#### Display DataFrame with columns id, first, last, from the authors table; sorted by last name, then by first name for authors with the same last name

In [19]:
pd.read_sql("""SELECT id, first, last FROM authors ORDER BY last, first""", connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

#### Display DataFrame sorted in descending order by last name and ascending order by first name for authors with the same last name

In [20]:
pd.read_sql("""SELECT id, first, last FROM authors ORDER BY last DESC, first ASC""", connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

### Combining WHERE and ORDER BY

#### Display DataFrame with columns isbn, title, edition, and copyright, from the titles table; show books with title ending with 'How to Program' sorted in ascending order by title

In [21]:
pd.read_sql("""SELECT isbn, title, edition, copyright FROM titles
                WHERE title LIKE '%How to Program' 
                ORDER BY title""", connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

## Section 17.2.5 INNER JOIN

### Display head of DataFrame containing authors with ISBNs for books written by each author

In [22]:
pd.read_sql("""SELECT first, last, isbn FROM authors
            INNER JOIN author_ISBN ON authors.id = author_ISBN.id
            ORDER BY last, first""", connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

## Section 17.2.6 INSERT INTO

### Call the connection's cursor method

In [23]:
cursor = connection.cursor()

### Insert new author named Sue Red into the authors table by calling Cursor method execute

In [24]:
cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ('Sue', 'Red')""")

### Display DataFrame of authors table to confirm addition of Sue Red

In [25]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

## Section 17.2.7 UPDATE

### Change Sue Red's last name to 'Black' by modifying the authors table

In [26]:
cursor = cursor.execute("""UPDATE authors SET last='Black' WHERE last='Red' AND first='Sue'""")

### Use rowcount to confirm the number of rows modified

In [27]:
cursor.rowcount

1

### Confirm the modification by displaying DataFrame of authors table

In [28]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black

## Section 17.2.8 DELETE FROM

### Remove Sue Black from authors table using her author ID

In [29]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

### Confirm change using rowcount

In [30]:
cursor.rowcount

1

### Confirm the removal by displaying DataFrame of authors table

In [31]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

## Final Results

### Display final state of each of the 3 tables

#### Display DataFrame of authors table

In [32]:
pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

#### Display DataFrame of titles table

In [33]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

#### Display DataFrame of author_ISBN table

In [34]:
pd.read_sql('SELECT * FROM author_ISBN', connection)

    id        isbn
0    1  0134289366
1    2  0134289366
2    5  0134289366
3    1  0135404673
4    2  0135404673
5    1  0132151006
6    2  0132151006
7    3  0132151006
8    1  0134743350
9    2  0134743350
10   1  0133976890
11   2  0133976890
12   1  0133406954
13   2  0133406954
14   3  0133406954
15   1  0134601548
16   2  0134601548
17   1  0136151574
18   2  0136151574
19   4  0136151574
20   1  0134448235
21   2  0134448235
22   1  0134444302
23   2  0134444302

### Disconnect from the database when access is no longer needed

In [35]:
connection.close()

##### Above examples from "Intro to Python" by Paul Deitel and Harvey Deitel, Copyright 2020